### Tidy Data

Good practice is to import the necessary libraries at the start of your notebook/script

In [3]:
import pandas as pd
import numpy as np

Getting your data into this format requires some upfront work, but that work pays off in the long term. Once you have tidy data and pandas data frames, you will spend much less time manipulating data from one representation to another, allowing you to spend more time on the analytic questions at hand.

Instead of using a csv file, we can also connet to datasets via a URL and then create a dataframe using `pandas`

In [4]:
base_url = "https://github.com/byuidatascience/data4python4ds/raw/master/data-raw/" # base URL for datasets
table1 = pd.read_csv("{}table1/table1.csv".format(base_url)) # read table1 dataset
table2 = pd.read_csv("{}table2/table2.csv".format(base_url)) # read table2 dataset
table3 = pd.read_csv("{}table3/table3.csv".format(base_url)) # read table3 dataset
table4a = pd.read_csv("{}table4a/table4a.csv".format(base_url)) # read table4a dataset
table4b = pd.read_csv("{}table4b/table4b.csv".format(base_url)) # read table4b dataset
table5 = pd.read_csv("{}table5/table5.csv".format(base_url), dtype = 'object') # read table5 dataset

In [5]:

display(table1)
display(table2)
display(table3)
display(table4a)
display(table4b)

       country  year   cases  population
0  Afghanistan  1999     745    19987071
1  Afghanistan  2000    2666    20595360
2       Brazil  1999   37737   172006362
3       Brazil  2000   80488   174504898
4        China  1999  212258  1272915272
5        China  2000  213766  1280428583

        country  year        type       count
0   Afghanistan  1999       cases         745
1   Afghanistan  1999  population    19987071
2   Afghanistan  2000       cases        2666
3   Afghanistan  2000  population    20595360
4        Brazil  1999       cases       37737
5        Brazil  1999  population   172006362
6        Brazil  2000       cases       80488
7        Brazil  2000  population   174504898
8         China  1999       cases      212258
9         China  1999  population  1272915272
10        China  2000       cases      213766
11        China  2000  population  1280428583

       country  year               rate
0  Afghanistan  1999       745/19987071
1  Afghanistan  2000      2666/20595360
2       Brazil  1999    37737/172006362
3       Brazil  2000    80488/174504898
4        China  1999  212258/1272915272
5        China  2000  213766/1280428583

       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

       country        1999        2000
0  Afghanistan    19987071    20595360
1       Brazil   172006362   174504898
2        China  1272915272  1280428583

These are all representations of the same underlying data, but they are not equally easy to use. One dataset, the tidy dataset, will be much easier to work with.

There are three interrelated rules which make a dataset tidy:

**1. Each variable must have its own column.**

**2. Each observation must have its own row.**

**3. Each value must have its own cell.**

![GitHub Codespaces](tidy_data.png)

In this example, only table1 is tidy. It’s the only representation where each column is a variable.

Why ensure that your data is tidy? There are two main advantages:

1. There’s a general advantage to picking one consistent way of storing data. If you have a consistent data structure, it’s easier to learn the tools that work with it because they have an underlying uniformity.

2. There’s a specific advantage to placing variables in columns because it allows `Pandas’` and `NumPy’s` vectorised nature to shine. As you learned in `assign` and `aggregate` functions, most built-in functions work with vectors of values. That makes transforming tidy data feel particularly natural.

`Pandas` work well with tidy data. Here are a couple of small examples showing how you might work with table1.

In [ ]:
# Compute rate per 10,000
table1.assign(
    rate = table1.cases / table1.population * 10000
)

# using lambda
table1.assign(
    rate = lambda x: x.cases / x.population * 10000
)

       country  year   cases  population      rate
0  Afghanistan  1999     745    19987071  0.372741
1  Afghanistan  2000    2666    20595360  1.294466
2       Brazil  1999   37737   172006362  2.193930
3       Brazil  2000   80488   174504898  4.612363
4        China  1999  212258  1272915272  1.667495
5        China  2000  213766  1280428583  1.669488

In [7]:
(table1.
  groupby('year').
  agg(n = ('cases', 'sum')).
  reset_index())

   year       n
0  1999  250740
1  2000  296920

### Pivoting

Untidy data will suffer from one of two common problems:

- One variable might be spread across multiple columns.

- One observation might be scattered across multiple rows.

Typically a dataset will only suffer from one of these problems; it’ll only suffer from both if you’re really unlucky! To fix these problems, you’ll need two functions in pandas: `melt()`, `pivot()`, and `pivot_table()`. There are two additional functions called `stack()` and `unstack()` that use multi-index columns and rows.

**1. Pivoting longer `.melt()`** - Sometimes some of the column names are not names of variables, but values of a variable. To tidy a dataset like this, we need to stack the offending columns into a new pair of variables.

In [10]:
table4a

       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

To tidy a dataset like this, we need to stack the offending columns into a new pair of variables. To describe that operation we need three parameters:

 - The set of columns whose names are identifier variables, not values. In this example, `country` is the identifier column and the value columns are `1999` and `2000`.

- The name of the variable to move the column names to. Here it is `year`.

- The name of the variable to move the column values to. Here it’s `cases`.

In [ ]:
table4a.melt(['country'], var_name = "year", value_name = "cases")

       country  year   cases
0  Afghanistan  1999     745
1       Brazil  1999   37737
2        China  1999  212258
3  Afghanistan  2000    2666
4       Brazil  2000   80488
5        China  2000  213766

#### Exercise

Use `.melt()` to tidy table4b in a similar fashion.

In [12]:
table4b.melt(['country'], var_name = 'year', value_name = 'population')

       country  year  population
0  Afghanistan  1999    19987071
1       Brazil  1999   172006362
2        China  1999  1272915272
3  Afghanistan  2000    20595360
4       Brazil  2000   174504898
5        China  2000  1280428583

**2. Pivoting wider `.pivot()`** - is the opposite of `melt()`. You use it when an observation is scattered across multiple rows. For example, take table2

In [13]:
table2

        country  year        type       count
0   Afghanistan  1999       cases         745
1   Afghanistan  1999  population    19987071
2   Afghanistan  2000       cases        2666
3   Afghanistan  2000  population    20595360
4        Brazil  1999       cases       37737
5        Brazil  1999  population   172006362
6        Brazil  2000       cases       80488
7        Brazil  2000  population   174504898
8         China  1999       cases      212258
9         China  1999  population  1272915272
10        China  2000       cases      213766
11        China  2000  population  1280428583

To tidy this up, we first analyse the representation in similar way to `melt()`. This time, however, we only need two parameters:

The column to take variable names from. Here, it’s `type`.

The column to take values from. Here it’s `count`.

Depending on the index, we will need to use either `pivot()` or `pivot_table()`.

In [ ]:
table2.pivot(
    index = ['country', 'year'], # multi-column index
    columns = 'type', # column to take variable names from
    values = 'count').reset_index() # column to take values from

type      country  year   cases  population
0     Afghanistan  1999     745    19987071
1     Afghanistan  2000    2666    20595360
2          Brazil  1999   37737   172006362
3          Brazil  2000   80488   174504898
4           China  1999  212258  1272915272
5           China  2000  213766  1280428583

Strict reshaping → requires that the combination of `index` + `columns` is unique.

If duplicates exist (e.g., if table2 had two rows for Afghanistan–1999–cases), `.pivot()` will throw an error, as we saw.

Let's create a dummy table and see what this looks like:

In [21]:
data = {
    "country": ["Afghanistan","Afghanistan","Afghanistan","Afghanistan","Brazil","Brazil"],
    "year":    [1999,1999,1999,1999,1999,1999],
    "type":    ["cases","cases","population","population","cases","population"],
    "count":   [745,750,19987071,19987071,37737,172006362]
}

table2a_example = pd.DataFrame(data)
table2a_example

       country  year        type      count
0  Afghanistan  1999       cases        745
1  Afghanistan  1999       cases        750
2  Afghanistan  1999  population   19987071
3  Afghanistan  1999  population   19987071
4       Brazil  1999       cases      37737
5       Brazil  1999  population  172006362

In [27]:
table2a_example.pivot_table(
    index = ['country', 'year'], # multi-column index
    columns = 'type', # column to take variable names from
    values = 'count').reset_index() # column to take values from

type      country  year    cases   population
0     Afghanistan  1999    747.5   19987071.0
1          Brazil  1999  37737.0  172006362.0

By default, the resultant values will be the average of the replicates, we can take care of this by explicitly stating what summary statistic we would like to see using `aggfunc=''`

In [28]:
table2a_example.pivot_table(
    index = ['country', 'year'], # multi-column index
    columns = 'type', # column to take variable names from
    values = 'count',
    aggfunc='sum').reset_index() # column to take values from

type      country  year  cases  population
0     Afghanistan  1999   1495    39974142
1          Brazil  1999  37737   172006362

#### Split

`str.split()` pulls apart one column into multiple columns, by splitting wherever a separator character appears. Take table3:

In [36]:
table3

       country  year               rate
0  Afghanistan  1999       745/19987071
1  Afghanistan  2000      2666/20595360
2       Brazil  1999    37737/172006362
3       Brazil  2000    80488/174504898
4        China  1999  212258/1272915272
5        China  2000  213766/1280428583

The rate column contains both cases and population variables, and we need to split it into two variables. `str.split()` takes the name of the column to split. The names of the columns to separate into can be names using `rename()`.

In [ ]:
new_columns = (table3.
  rate.str.split("/", expand = True).
  rename(columns = {0: "cases", 1: "population"})
  )

pd.concat([table3.drop(columns = 'rate'), new_columns.astype('float')], axis = 1) # axis =1 means concatenate columns

       country  year     cases    population
0  Afghanistan  1999     745.0  1.998707e+07
1  Afghanistan  2000    2666.0  2.059536e+07
2       Brazil  1999   37737.0  1.720064e+08
3       Brazil  2000   80488.0  1.745049e+08
4        China  1999  212258.0  1.272915e+09
5        China  2000  213766.0  1.280429e+09

#### Unite

For two string series the inverse of `str.split()` can be done with `+`: it combines multiple columns into a single column.

In [44]:
table5['new'] = table5['century'] + table5['year']
table5

       country century year               rate   new
0  Afghanistan      19   99       745/19987071  1999
1  Afghanistan      20   00      2666/20595360  2000
2       Brazil      19   99    37737/172006362  1999
3       Brazil      20   00    80488/174504898  2000
4        China      19   99  212258/1272915272  1999
5        China      20   00  213766/1280428583  2000

In [45]:
table5.assign(new = table5['century'] + table5['year'])
table5

       country century year               rate   new
0  Afghanistan      19   99       745/19987071  1999
1  Afghanistan      20   00      2666/20595360  2000
2       Brazil      19   99    37737/172006362  1999
3       Brazil      20   00    80488/174504898  2000
4        China      19   99  212258/1272915272  1999
5        China      20   00  213766/1280428583  2000

#### Exercise 1: From Long to Wide

Task: 

`ukbabynames` contains a listing of UK baby names occurring more than three times per year
between 1974 and 2020

The dataset contains columns like `year`, `sex`, `name`, and `n`.

Use `.pivot()` or `.pivot_table()` **(recall the unique index!)** to find the total number of babies born by sex in each year.

Rows should be years, columns should be sex (M / F), and values should be the sum of counts.

**Challenge - calculate the percent of babies who are female using your now tidy dataset**

In [61]:
# Import the dataset as gapminder using pd.read_csv()
babynames = pd.read_csv('../Data/ukbabynames.csv')
babynames
# babynames.info()

        year sex        name     n  rank            nation
0       1996   F      SOPHIE  7087     1   England & Wales
1       1996   F       CHLOE  6824     2   England & Wales
2       1996   F     JESSICA  6711     3   England & Wales
3       1996   F       EMILY  6415     4   England & Wales
4       1996   F      LAUREN  6299     5   England & Wales
...      ...  ..         ...   ...   ...               ...
565812  2020   F      Teagan     3   397  Northern Ireland
565813  2020   F     Teaghan     3   397  Northern Ireland
565814  2020   F     Tiffany     3   397  Northern Ireland
565815  2020   F      Treasa     3   397  Northern Ireland
565816  2020   F  Abbie-Rose     2   531  Northern Ireland

[565817 rows x 6 columns]

In [ ]:
babies_by_sex = babynames.pivot_table(
    index="year",
    columns="sex",
    values="n",
    aggfunc="sum"
)

babies_by_sex

# This is now a tidy long dataframe, I could apply Pythons vectorised nature and easily calculate percent female babies
babies_by_sex["pct_female"] = (
    babies_by_sex["F"] / (babies_by_sex["F"] + babies_by_sex["M"]) * 100
)

babies_by_sex

sex        F       M  pct_female
year
1974   34228   35773   48.896444
1975   32897   34965   48.476320
1976   31364   33465   48.379583
1977   30318   31954   48.686408
1978   31221   33031   48.591484
1979   33004   35323   48.303013
1980   33474   35367   48.625093
1981   33755   35266   48.905406
1982   32270   33895   48.772009
1983   31419   33651   48.284924
1984   31956   33136   49.093591
1985   32550   34113   48.827686
1986   31935   33871   48.529010
1987   32269   33965   48.719691
1988   32149   34056   48.559776
1989   30975   32503   48.796433
1990   32071   33896   48.616733
1991   32604   34418   48.646713
1992   32177   33610   48.910879
1993   30961   32373   48.885275
1994   30256   31397   49.074660
1995   29399   30650   48.958351
1996  324769  349040   48.198970
1997  332698  356674   48.261026
1998  327497  351389   48.240353
1999  318391  342790   48.154893
2000  308417  330920   48.240130
2001  303212  325328   48.240685
2002  301787  324809   48.162931
2003  313344  337030   48.179048
2004  321645  347030   48.101843
2005  324244  348202   48.218593
2006  336341  360017   48.300012
2007  344643  372711   48.043644
2008  356142  382245   48.232431
2009  352882  380257   48.133028
2010  360834  388079   48.181030
2011  360548  387730   48.183696
2012  360850  390068   48.054515
2013  345764  373704   48.058288
2014  344302  372653   48.022819
2015  344583  372921   48.025237
2016  343217  371315   48.033818
2017  334057  360691   48.083190
2018  322649  349302   48.016745
2019  313134  339881   47.952038
2020  299439  322434   48.151150

#### Exercise 2: From Wide to Long

WHO Tuberculosis Data

This dataset comes from the World Health Organization (WHO) and records the number of **tuberculosis (TB) cases** reported by different countries, broken down by sex and age group.

- **country, iso2, iso3**: identifiers for each country (name and ISO codes).
- **year**: the year of observation.
- **new_sp_m014, new_sp_m1524, …**: the number of new TB cases, where the code describes the **type of case**, the **sex**, and the **age group**.
  - Example: `new_sp_m014` = new cases, sputum positive (`sp`), male (`m`), ages 0–14 (`014`).

In [60]:
# Import the dataset as gapminder using pd.read_csv()
who = pd.read_csv('../Data/who.csv')
who
who.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7240 entries, 0 to 7239
Data columns (total 60 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country       7240 non-null   object
 1   iso2          7206 non-null   object
 2   iso3          7240 non-null   object
 3   year          7240 non-null   int64
 4   new_sp_m014   3173 non-null   float64
 5   new_sp_m1524  3209 non-null   float64
 6   new_sp_m2534  3206 non-null   float64
 7   new_sp_m3544  3219 non-null   float64
 8   new_sp_m4554  3223 non-null   float64
 9   new_sp_m5564  3218 non-null   float64
 10  new_sp_m65    3209 non-null   float64
 11  new_sp_f014   3174 non-null   float64
 12  new_sp_f1524  3194 non-null   float64
 13  new_sp_f2534  3200 non-null   float64
 14  new_sp_f3544  3199 non-null   float64
 15  new_sp_f4554  3204 non-null   float64
 16  new_sp_f5564  3195 non-null   float64
 17  new_sp_f65    3197 non-null   float64
 18  new_sn_m014   1045 non-null   float64
 19  new_sn_m1524  1030 non-null   float64
 20  new_sn_m2534  1022 non-null   float64
 21  new_sn_m3544  1025 non-null   float64
 22  new_sn_m4554  1027 non-null   float64
 23  new_sn_m5564  1021 non-null   float64
 24  new_sn_m65    1020 non-null   float64
 25  new_sn_f014   1040 non-null   float64
 26  new_sn_f1524  1022 non-null   float64
 27  new_sn_f2534  1016 non-null   float64
 28  new_sn_f3544  1020 non-null   float64
 29  new_sn_f4554  1018 non-null   float64
 30  new_sn_f5564  1017 non-null   float64
 31  new_sn_f65    1019 non-null   float64
 32  new_ep_m014   1038 non-null   float64
 33  new_ep_m1524  1026 non-null   float64
 34  new_ep_m2534  1020 non-null   float64
 35  new_ep_m3544  1024 non-null   float64
 36  new_ep_m4554  1020 non-null   float64
 37  new_ep_m5564  1015 non-null   float64
 38  new_ep_m65    1018 non-null   float64
 39  new_ep_f014   1032 non-null   float64
 40  new_ep_f1524  1021 non-null   float64
 41  new_ep_f2534  1021 non-null   float64
 42  new_ep_f3544  1021 non-null   float64
 43  new_ep_f4554  1017 non-null   float64
 44  new_ep_f5564  1017 non-null   float64
 45  new_ep_f65    1014 non-null   float64
 46  newrel_m014   190 non-null    float64
 47  newrel_m1524  182 non-null    float64
 48  newrel_m2534  183 non-null    float64
 49  newrel_m3544  184 non-null    float64
 50  newrel_m4554  184 non-null    float64
 51  newrel_m5564  185 non-null    float64
 52  newrel_m65    182 non-null    float64
 53  newrel_f014   190 non-null    float64
 54  newrel_f1524  184 non-null    float64
 55  newrel_f2534  182 non-null    float64
 56  newrel_f3544  183 non-null    float64
 57  newrel_f4554  183 non-null    float64
 58  newrel_f5564  183 non-null    float64
 59  newrel_f65    185 non-null    float64
dtypes: float64(56), int64(1), object(3)
memory usage: 3.3+ MB

#### Exercise: Reshape WHO Tuberculosis Data

The WHO dataset contains TB cases reported by country and year. Each combination of **type**, **sex**, and **age group** is stored as a separate column (`new_sp_m014`, `new_sp_f1524`, etc.), which makes the dataset **wide**.

Your task:  
1. Use `pd.melt()` to convert columns 5 through 60 into **two new columns**:  
   - `tb_codes` → the original variable name (e.g., `new_sp_m014`).  
   - `n` → the number of TB cases.

In [ ]:
# 2) Melt columns 5:60 into key-value pairs
who_long = who.melt(
    id_vars=["country", "year"],       # keep these fixed
    value_vars=who.columns[4:60],      # columns 5–60 (0-based index)
    var_name="tb_codes", 
    value_name="n"
)
who_long

            country  year     tb_codes      n
0       Afghanistan  1980  new_sp_m014    NaN
1       Afghanistan  1981  new_sp_m014    NaN
2       Afghanistan  1982  new_sp_m014    NaN
3       Afghanistan  1983  new_sp_m014    NaN
4       Afghanistan  1984  new_sp_m014    NaN
...             ...   ...          ...    ...
405435     Zimbabwe  2009   newrel_f65    NaN
405436     Zimbabwe  2010   newrel_f65    NaN
405437     Zimbabwe  2011   newrel_f65    NaN
405438     Zimbabwe  2012   newrel_f65    NaN
405439     Zimbabwe  2013   newrel_f65  725.0

[405440 rows x 4 columns]

2. Clean the new tidy dataframe so it does not have missing `missing values` in the `n` column.

In [70]:
# Drop missing values
who_long = who_long.dropna(subset=["n"])

# display the df
who_long.head()

who_long

                          country  year     tb_codes       n
17                    Afghanistan  1997  new_sp_m014     0.0
18                    Afghanistan  1998  new_sp_m014    30.0
19                    Afghanistan  1999  new_sp_m014     8.0
20                    Afghanistan  2000  new_sp_m014    52.0
21                    Afghanistan  2001  new_sp_m014   129.0
...                           ...   ...          ...     ...
405269                   Viet Nam  2013   newrel_f65  3110.0
405303  Wallis and Futuna Islands  2013   newrel_f65     2.0
405371                      Yemen  2013   newrel_f65   360.0
405405                     Zambia  2013   newrel_f65   669.0
405439                   Zimbabwe  2013   newrel_f65   725.0

[76046 rows x 4 columns]

### All Done!